# VLAN이 다를 때 통신하는 방법에 대한 숙제

**access mode?** → VLAN tag 를 붙여줌

access port 로 들어옴 → 테그를 없앰

access port 로 나감 → 테그를 붙여줌 

VLAN tag 가 달라서 통신을 할 수 없음

**different_vlan**

1. PC1에서 S1으로 갈 때 VID 10을 받음
2. S1에서 S2로 갈 때 VID 10을 떼고 VID 20을 다시 받음
3. S2에서 PC2로 갈 때 VID 20을 뗌

이 과정을 통해 통신

# IT 발표에 대한 세부 피드백

## PVST(Per-VLAN Spanning Tree)

Spanning tree는 2개의 포트를 사용

**Per_VLAN**

각 VLAN이 서로 다른 포트를 사용

아래 나왔듯이 10은 아래 것을, 20은 위에 것을 사용 

### 실제 설정 방법(기본 설정이 다 되었다는 전제 하에)

**pka_Per_VLAN**

1. SW0 → vlan 10에 대한 root switch
SW2 → vlan 20에 대한 root switch

```bash
SW0(config)#spanning-tree vlan 10 root primary
...
SW2(config)#spanning-tree vlan 10 root primary
```

1. SW3 → vlan 10, 20에 대한 root bridge

SW0 → vlan 10에 대한 secondary root bridge
SW2 → vlan 20에 대한 secondary root brigde

```bash
SW3(config)#spanning-tree vlan 10,20 root primary
...
SW0(config)#spanning-tree vlan 10 root secondary
...
SW2(config)#spanning-tree vlan 20 root secondary
```

## portfast

switch의 동작방식 중 learning, flooding과정을 건너뛰는 것

### 실제 설정 방법

```bash
SW1(config)#interface fastEthernet0/1
SW1(config-if)#spanning-tree portfast
...
SW1(config)#spanning-tree portfast default
```

## Access Control List

**cisco ACL** → 특정 traffic 허용/ 차단 (FW)
                    → 특정 대역 정보를 등록할 때 (NAT)

특징

- whitelist 방식 ↔ blacklist 방식(allowlist 방식 ↔ blocklist 방식)
    - cisco ACL = allowlist 방식

ACL의 분류

- standard ACL
    - 1 ~ 99
    - 출발지 IP정보를 가지고 허용 및 차단
    - ex1)
        - 172.16.0.0/24 대역 만 허용
        
        ```bash
        Router(config)#access-list 1 permit 172.16.0.0 0.0.0.255
        ```
        
        - cisco ACL은 마지막에 deny any가 숨어있음
    - ex2)
        - 172.16.0.0/24 만 차단
        
        ```bash
        Router(config)#access-list 1 deny 172.16.0.0 0.0.0.255
        Router(config)#access-list 1 permit any
        ```
        
        - point 1
            - ACL은 sequence를 가짐
            - 기본적으로 작성 순서대로 동작
            - 그래서 중간에 명령어를 끼워 넣을 수 없음
            - 그래서 named ACL을 쓰면 중간에 안 쓴 명령어를 넣을 수 있음
- extended ACL
    - 100 ~ 199
    - 출발지와 목적지 IP정보, protocol, port 를 가지고 허용 및 차단