# 가
## 1. 모든 라우터의 이름 변경(토폴로지 참고)

Router>enable

Router#configure terminal

Router(config)#**hostname {지정할 라우터의 이름}**

## 2. 다음과 같이 IP 할당

- PC는 해당 네트워크의 첫 번째 IP

- Server는 해당 네트워크의 열 번째 IP

- Default Gateway는 해당 네트워크의 마지막 IP

| name    | IP address  | Subnet Mask     | Default Gateway |
|---------|-------------|-----------------|-----------------|
| PC0     | 10.0.0.1    | 255.255.255.0   | 10.0.0.254      |
| PC1     | 10.0.1.1    | 255.255.255.128 | 10.0.1.126      |
| PC2     | 10.0.1.129  | 255.255.255.192 | 10.0.1.190      |
| PC3     | 10.0.1.193  | 255.255.255.240 | 10.0.1.206      |
| PC4     | 1.1.1.5     | 255.255.255.252 | 1.1.1.6         |
| PC5     | 11.11.0.1   | 255.255.255.128 | 11.11.0.126     |
| PC6     | 11.11.0.129 | 255.255.255.224 | 11.11.0.158     |
| PC7     | 11.11.0.2   | 255.255.255.128 | 11.11.0.126     |
| PC8     | 11.11.0.130 | 255.255.255.224 | 11.11.0.158     |
| Server0 | 2.5.2.10    | 255.255.255.0   | 2.5.2.254       |
| Server1 | 110.0.0.10  | 255.255.255.0   | 110.0.0.254     |
| Server2 | 4.4.5.10    | 255.255.255.0   | 4.4.5.254       |
| Server3 | 6.6.6.10    | 255.255.255.0   | 6.6.6.254       |

## 3. R1 라우터 GigabitEthernet0/0 포트에 description 설정

*문구는 **This is Private Network**로 설정*

R1>enable

R1#configure terminal

R1(config)#interface GigabitEthernet0/0

R1(config-if)#**description This is Private Network**

## 4. R3 라우터에 배너 설정
*문구는 **Check your access permissions.** 로 설정*

R3>enable

R3#configure terminal

R3(config)#**banner motd ? Check your access permissions. ?**

## 5. R2, R3, R4, R7 라우터에 비밀번호 
*비밀번호는 **2017yynet**으로 설정*

R2>enable

R2#configure terminal

R2(config)#**enable secret 2017yynet**

## 6. R1, R4, R8, R9는 로컬 계정 인증

*username은 **자신의 hostname**, password는 **Skills39@@** 로 설정*

R1>enable

R1#configure terminal

R1(config)#**username R1 password Skills39@@**

## 7. R5의 정보 확인
R5는 현재 잠긴 상태이기 때문에 **CDP**를 사용해서 확인

R4>enable

R4#configure terminal

R4(config)#interface Serial 0/0/1

R4(config-if)#**cdp enable**

R4(config-if)#exit

R4(config)#**cdp run**

R4(config)#exit

R4#**show cdp neighbors detail**

(안되면 R4#**show cdp neighbors** 이 명령어로 확인하려는 기기가 있는지 확인)

## 8. clock rate 는 64000으로 설정

R2>enable

R2#configure terminal

R2(config)#interface Serial 0/0/0

R2(config-if)#**clock rate 64000**

<br>

**모르는 애들을 위해 모든 명령어를 썼지만 다음 것 부터는 그냥 바로바로 쓰겠습니다**